service/src/intTest/resources/illogicalmessage/COPC_IN000001UK01_ebxml.txt

<?xml version=\"1.0\" encoding=\"UTF-8\"?><SOAP:Envelope xmlns:xsi=\"http://www.w3c.org/2001/XML-Schema-Instance\" xmlns:SOAP=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:eb=\"http://www.oasis-open.org/committees/ebxml-msg/schema/msg-header-2_0.xsd\" xmlns:hl7ebxml=\"urn:hl7-org:transport/ebxml/DSTUv1.0\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"><SOAP:Header><eb:MessageHeader SOAP:mustUnderstand=\"1\" eb:version=\"2.0\"><eb:From><eb:PartyId eb:type=\"urn:nhs:names:partyType:ocs+serviceInstance\">RHM-803229</eb:PartyId></eb:From><eb:To><eb:PartyId eb:type=\"urn:nhs:names:partyType:ocs+serviceInstance\">RHM-801710</eb:PartyId></eb:To><eb:CPAId>S2030731A2137927</eb:CPAId><eb:ConversationId>a023ef7e-be27-4a70-949a-38f7865e83bc</eb:ConversationId><eb:Service>urn:nhs:names:services:gp2gp</eb:Service><eb:Action>COPC_IN000001UK01</eb:Action><eb:MessageData><eb:MessageId>FA039330-7E63-446A-8CA4-E9E0D00DA6E8</eb:MessageId><eb:Timestamp>2013-10-28T08:59:26Z</eb:Timestamp></eb:MessageData><eb:DuplicateElimination/></eb:MessageHeader></SOAP:Header><SOAP:Body><eb:Manifest SOAP:mustUnderstand=\"1\" eb:version=\"2.0\"><eb:Reference xlink:href=\"cid:3f35e4da-3faf-11e3-b10c-8bc15657569c@spine.nhs.uk\"><eb:Schema eb:location=\"http://www.nhsia.nhs.uk/schemas/HL7-Message.xsd\" eb:version=\"1.0\"/><eb:Description xml:lang=\"en\">HL7 payload</eb:Description><hl7ebxml:Payload style=\"HL7\" encoding=\"XML\" version=\"3.0\"/></eb:Reference></eb:Manifest></SOAP:Body></SOAP:Envelope>